# Broadcasting Methods

### Import Pandas

In [1]:
import pandas as pd

### Read CSV

In [2]:
salaries = pd.read_csv("mls_salaries.csv")

In [3]:
# called the head method to see what were working with
salaries.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

### Broadcasting with the .add() method

In [4]:
# broadcast 5 to all values using the add() math broadcasting method
salaries["base_salary"].add(5) # they don't chage the original

0      1912505.0
1        65630.0
2       150005.0
3        99230.0
4        65005.0
         ...
610     126505.0
611      80005.0
612     350005.0
613          NaN
614     175005.0
Name: base_salary, Length: 615, dtype: float64

### Original DataFrame

In [5]:
salaries["base_salary"]

0      1912500.0
1        65625.0
2       150000.0
3        99225.0
4        65000.0
         ...
610     126500.0
611      80000.0
612     350000.0
613          NaN
614     175000.0
Name: base_salary, Length: 615, dtype: float64

### Broadcasting with the .sub() method

In [6]:
# broadcast -5 to all values using the sub() math broadcasting method
salaries["base_salary"].sub(5)# doesn't chage the original dataset

0      1912495.0
1        65620.0
2       149995.0
3        99220.0
4        64995.0
         ...
610     126495.0
611      79995.0
612     349995.0
613          NaN
614     174995.0
Name: base_salary, Length: 615, dtype: float64

### Original DataFrame

In [7]:
salaries["base_salary"]

0      1912500.0
1        65625.0
2       150000.0
3        99225.0
4        65000.0
         ...
610     126500.0
611      80000.0
612     350000.0
613          NaN
614     175000.0
Name: base_salary, Length: 615, dtype: float64

### Broadcasting with the .sub() method

In [8]:
# broadcast Salary in millions (/ 1000000) to all values using the div() math broadcasting method
salaries["base_salary"].div(1000000)# doesn't chage the original dataset

0      1.912500
1      0.065625
2      0.150000
3      0.099225
4      0.065000
         ...
610    0.126500
611    0.080000
612    0.350000
613         NaN
614    0.175000
Name: base_salary, Length: 615, dtype: float64

In [9]:
# again, the original is in tact
salaries["base_salary"]

0      1912500.0
1        65625.0
2       150000.0
3        99225.0
4        65000.0
         ...
610     126500.0
611      80000.0
612     350000.0
613          NaN
614     175000.0
Name: base_salary, Length: 615, dtype: float64

### Convert `base_salary` to Euros

In [10]:
# broadcast salary in EUR to all values using the mul() math broadcasting method
salaries["base_salary"].mul(0.82) # 1/31/21

0      1568250.0
1        53812.5
2       123000.0
3        81364.5
4        53300.0
         ...
610     103730.0
611      65600.0
612     287000.0
613          NaN
614     143500.0
Name: base_salary, Length: 615, dtype: float64

### Adding a new column to a DataFrame

In [11]:
# create a new column name and assign it to = the operation 
salaries["base_salary_eur"] = salaries["base_salary"].mul(0.82)
salaries.head(3) # returns the eruos column concatenated to our original DataFrame (no inplace= needed)

,club,last_name,first_name,position,base_salary,guaranteed_compensation,base_salary_eur
0,ATL,Almiron,Miguel,M,1912500.0,2297000.0,1568250.0
1,ATL,Ambrose,Mikey,D,65625.0,65625.0,53812.5
2,ATL,Asad,Yamil,M,150000.0,150000.0,123000.0